Lenti84/VdMot_Controller/software_stm32/src/motor.cpp
                      deadzone_count = closing_count - opening_count;
                      scaler = opening_count / 100;

                      COMM_DBG.print("A: learned closing_count = "); COMM_DBG.println(closing_count);
                      COMM_DBG.print("A: learned opening_count = "); COMM_DBG.println(opening_count);
                      COMM_DBG.print("A: learned deadzone_count = "); COMM_DBG.println(deadzone_count);
                      COMM_DBG.print("A: learned scaler = "); COMM_DBG.println(scaler);
                      COMM_DBG.print("A: learned mean current = "); COMM_DBG.println(myvalvemots[valveindex].meancurrent);

                      myvalvemots[valveindex].closing_count = closing_count;
                      myvalvemots[valveindex].opening_count = opening_count;
                      myvalvemots[valveindex].deadzone_count = deadzone_count;
                      myvalvemots[valveindex].scaler = scaler;
                      myvalvemots[valveindex].actual_position = 0;    // because valve was closed completely                    
                      myvalvemots[valveindex].status = VLV_STATE_IDLE;

                      valveindex = 255;
                                                                                  
                      valvestate = A_IDLE;
                    }    
                    else if (temp == M_RES_NOCURRENT) {
                      COMM_DBG.println("A: undercurrent");
                      myvalvemots[valveindex].status = VLV_STATE_OPENCIR;
                      myvalvemots[valveindex].target_position = myvalvemots[valveindex].actual_position;
                      valvestate = A_IDLE;
                      isr_counter=0;
                    }     
                  }           
                  break;

                  
    default:      valvestate = A_IDLE;
                  break;  
  }
  result = 0;

  return result;
}





byte motorcycle (int mvalvenr, byte cmd) {
  #define M_INIT      0
  #define M_IDLE      1
  #define M_OPEN      2
  #define M_CLOSE     3
  #define M_TURNING   4
  #define M_TURNON    8
  #define M_STOP      5
  #define M_STOP_ISR  6
  #define M_UNDERCURR 7

  static byte motorstate = M_INIT;

  static int cyclecnt = 0;
  static int debouncecnt = 0;
  static int testcnt = 0;
  static byte undercurrcnt = 0;
  static byte overcurrcnt = 0;

  static int currentbound_low;              // lower current limit for detection of end stop
  static int currentbound_high;             // upper current limit for detection of end stop

  static unsigned int meancurrent_cnt;      // counts meancurrent values
  static long meancurrent_mem;              // memory for meancurrent values
  byte result;

  // quickpass for isr state switching
  if(cmd==CMD_M_STOP_ISR) {
    motorstate = M_STOP_ISR;
    //result = M_RES_STOP_ISR;
  }
  //else {
    switch (motorstate) {
      case M_INIT:  MUX_OFF();         // relay MUX off
                    ena_motor(0, 0);
                    DIR_OFF();         // direction off
  
                    motorstate = M_IDLE;
                    isr_turning = 0;
                    isr_counter = 0;
                    isr_target = 0;
                    result = M_RES_INIT;
                    isr_timer_go = 0;
                    isr_timer_fin = 0;
  
                    break;
  
      case M_IDLE:
                    if (cmd == CMD_M_OPEN) {
                      motorstate = M_OPEN;  
                      result = M_RES_OPENS;
                    }
                    else if (cmd == CMD_M_CLOSE) {
                      motorstate = M_CLOSE;  
                      result = M_RES_CLOSES;
                    }
                    else if (cmd == CMD_M_STOP) {
                      motorstate = M_STOP;
                      result = M_RES_STOP;  
                    }
                    else {
                      motorstate = M_IDLE;  
                      result = M_RES_IDLE;
                    }
  
                    // correct motor nr?
                    if (motorstate != M_IDLE && mvalvenr > (int) ACTUATOR_COUNT) {
                      motorstate = M_IDLE;
                      result = M_RES_IDLE;
                    }

                    undercurrcnt = 0;
                    overcurrcnt = 0;
                    
                    break;
      
      case M_OPEN:  
                    COMM_DBG.println("M: state open");                                  
                    set_motor(mvalvenr, DIR_OPEN);
                    //digitalWrite(POWER_ENA, 0);   // enable PSU for vlaves   
                    delay(50);    // wait for relay
                    //ena_motor(valvenr, 1);  
  
                    motorstate = M_TURNON;
                    isr_valvenr = mvalvenr;
                    isr_counter=0;
                    cyclecnt = 0;
                    debouncecnt = 0;                  
                    result = M_RES_OPENS;
                    attachInterrupt(digitalPinToInterrupt(REVINPIN), isr_count, RISING);
                    
                    break;
                    
      case M_CLOSE:
                    COMM_DBG.println("M: state close");                                 
                    set_motor(mvalvenr, DIR_CLOSE);
                    //digitalWrite(POWER_ENA, 0);   // enable PSU for vlaves
                    delay(50);    // wait for relay
                    //ena_motor(mvalvenr, 1);
                      
                    motorstate = M_TURNON;
                    isr_valvenr = mvalvenr;
                    isr_counter=0;
                    cyclecnt = 0;
                    debouncecnt = 0;
                    result = M_RES_CLOSES;
                    attachInterrupt(digitalPinToInterrupt(REVINPIN), isr_count, RISING);
  
                    break;
                    

      case M_TURNON:
                    isr_turning = 1;
                    result = M_RES_TURNING;
                    isr_timer_go = 1;

                    currentbound_low = (int) m_meancurrent * 10 * -3;
                    currentbound_high = (int) m_meancurrent * 10 * 3;

                    meancurrent_mem = 0;
                    meancurrent_cnt = 0;

                    // check if pwm is finished
                    if(isr_timer_fin) {
                      motorstate = M_TURNING;
                      isr_timer_fin = 0;
                      isr_timer_go = 0;
                    }

                    break;

      case M_TURNING:
                    isr_turning = 1;
                    result = M_RES_TURNING;
    
                    if (cmd == CMD_M_STOP) {
                      motorstate = M_STOP;  
                    }
                    cyclecnt++;
                                
